#pragma once
#include<Windows.h>
#include<iostream>
#include<tchar.h>

TCHAR srcName[];
TCHAR shellName[];

//*******************************************
//获取加密程序路径与壳程序路径
VOID getPath();
//*******************************************

//*******************************************
//将加密后文件复制到壳中
BOOL moveCode();
//*******************************************

//*******************************************
//加密程序(可使用加密算法)
//参数一 加密文件缓冲区 参数二 缓冲区大小 
VOID encry(LPVOID srcBuf, DWORD size);
//*******************************************

//*******************************************
//添加节
//参数一 需要添加节的PE文件缓冲区 参数二 壳文件大小 参数三 需要添加的节大小
HANDLE addSection(DWORD buf, DWORD shellSize, DWORD srcSize);
//*******************************************

//*********************************************************************
//区段对齐 参数1地址 参数2对齐粒度
DWORD Align(DWORD address, DWORD ratio);
//*********************************************************************

//*********************************************************************
//RVA转FOA 参数1基址，参数二RVA
DWORD RVA2FOA(LPVOID buf, LPVOID RVA);
//*********************************************************************

//*********************************************************************
//给PE文件新增节 移动导入表 手动添加dll
//参数1是旧缓冲区 参数2是旧缓冲区大小
//返回值是新增节后的PE缓冲区 
LPVOID PEAddSection(LPVOID oldBuf,DWORD size);
//*********************************************************************
